# Copyright 2024-2025 The Alibaba Wan Team Authors. All rights reserved.
import copy
import os

os.environ['TOKENIZERS_PARALLELISM'] = 'false'

from .wan_a2v_14B import a2v_14B
from .wan_a2v_1_3B import a2v_1_3B

WAN_CONFIGS = {
    'a2v-14B': a2v_14B,
    'a2v-1.3B': a2v_1_3B,
}

SIZE_CONFIGS = {
    '720*1280': (720, 1280),
    '1280*720': (1280, 720),
    '480*832': (480, 832),
    '832*480': (832, 480),
    '1024*1024': (1024, 1024),
    '512*512': (512, 512),
}

MAX_AREA_CONFIGS = {
    '720*1280': 720 * 1280,
    '1280*720': 1280 * 720,
    '480*832': 480 * 832,
    '832*480': 832 * 480,
    '512*512': 512 * 512, # 训练时采用的尺寸
}

SUPPORTED_SIZES = {
    't2v-14B': ('720*1280', '1280*720', '480*832', '832*480'),
    't2v-1.3B': ('480*832', '832*480'),
    'i2v-14B': ('720*1280', '1280*720', '480*832', '832*480'),
    't2i-14B': tuple(SIZE_CONFIGS.keys()),
    'a2v-14B': ('720*1280', '1280*720', '480*832', '832*480', '512*512'),
    'a2v-1.3B': ('480*832', '832*480', '512*512'),
}
